Repository: mozilla-l10n/mt-training-data
Catalog: ttj/ttj_pontoon.tmx
Source language: en_us
Languages: ttj

source: { $actionType } <micIcon></micIcon> and respond as naturally as you can
ttj: { $actionType } <micIcon></micIcon>kandi ogarukemu otabandize kuteekereza muno

source: { $actionType } <playIcon></playIcon> and write down what you hear the person saying
ttj: { $actionType } <playIcon></playIcon> handiika ebi orukuhurra omuntu naagamba.

source: { $actionType } <playIcon></playIcon> Listen to the audio clip, and check the transcription. Does it match? If not, edit it to match perfectly.
ttj: { $actionType } <playIcon></playIcon> Huliiriza akatambi k'amaraka, kandi orole obu karaaba nikasisana n'omulingo iraka lihandiikirwemu. Obu biraaba bitarukusisana obigorre obitereekereze.

source: Add a question <icon></icon> in { $currentLocale } for people to answer
ttj: Yoongeraho ekikaguzo <icon></icon> eki { $currentLocale } abantu baraagarukamu.

source: Add information
ttj: Yongeraho hali ebi ebigambirwe.

source: An error occurred while creating this transcript
ttj: Habaireho ensobi omu kuhandiika akatambi k'amaraka

source: An error occurred while editing the transcript
ttj: Habaireho ensobi mu kugorra ekihandiiko ky'amaraka

source: An error occurred while recording
ttj: Habaireho ensobi mu kukwata akatambi

source: An error occurred while skipping the transcript
ttj: Habaireho ensobi mu kuguruka ekihandiiko ky'amaraka

source: An error occurred while skipping this prompt
ttj: Habaireho ensobi obu obaire nooguruka ekireeterezo (prompt) kinu

source: An error occurred while submitting the report
ttj: Habaireho ensobi obu obaire noohayo lipoota

source: An error occurred while uploading your response
ttj: Habaireho ensobi omu kuhayo ekigarukwamu kyawe

source: An error occurred while voting the transcript
ttj: Habaireho ensobi mu kukoma ekihandiiko

source: Answer
ttj: Garukamu

source: Are you already in our Beta testing group for Common Voice’s Spontaneous Speech Project?
ttj: Oli mu katebe kaitu aka Beta Testing Group akarukukwata amaraka ag'embazo ezitateekaniziibwe?

source: Ask sensitive questions
ttj: Kaguza ebikaguzo ebitanguhire

source: A transcription should capture every word or non-lexical conversation sound that was said by the person, including repetitions.
ttj: Oine kurora ngu wahandiika buli kigambo hamu n'amaraka amahuuni agali mu katambi k'amaraka.

source: Attention!
ttj: Weetegereze!

source: Better support for language realities like translanguaging and <mark>code-switching</mark>
ttj: Obusagiki oburukukiraho oburukukwata ha by'endimi nk'okukozesa endimi itali zimu omu bwire bumu. <mark>code-switching</mark>

source: Better support for languages that have little or <mark>no text corpus</mark> to use (eg, sociolects, variants, historically unscripted languages etc)
ttj: Obusagiki oburukukiraho obw'endimi ezitaine rundi eziine kopasi enceke or <mark>no text corpus</mark>

source: By clicking “Send a link to my email”, you agree to our <termsLink>Terms of Service</termsLink> and <privacyLink>Privacy Policy</privacyLink> and that Mozilla may email you with information on how to participate in the Beta Testing for Common Voice’s Spontaneous Speech Project.
ttj: Obu orukunyiga "Sindika ensumiikanizi ha mukura gwange ogw'ebbaroha emeiri", noikiranganiza na<termsLink>Terms of service</termsLink><privacyLink>kandi</privacyLink>Mozilla neesobora kukusindikira ebbaroha ya imeiri kukwoleka nkooku osobora kwetaba mu purojekiti enu eya Voice’s Spontaneous Speech.

source: By telling us about yourself, you will help developers build more inclusive technology
ttj: Okutugambira ebirukukukwataho nukuyamba abakugu baitu kwombeka tekinirogiya eya boona.

source: Cancel
ttj: Sazaamu

source: Change
ttj: Hindura

source: Changes the language dataset to which you're contributing
ttj: Endimi ezindi niziija omu bwire obutali bwa hara

source: Changes website text only.
ttj: Nikihindura ekihandiiko ky'omukutu (weebusaiti) kyonka.

source: Check
ttj: Kebera

source: Choose simple questions that are easy for anyone to understand, regardless of culture or context
ttj: Komamu ebikaguzo ebirukworoba ebya buli muntu weena asobora kwetegereza.

source: Click
ttj: Nyiga

source: Click <guidanceLink>here</guidanceLink> to learn how to use this page
ttj: Nyiga <guidanceLink>here</guidanceLink> kwega kukozesa peeji enu

source: Comment
ttj: Gambaho

source: Common Voice is launching a second platform focused on collecting organic, spontaneous, unscripted speech. This will help lots of communities collect data more quickly, as well as being useful for data scientists and developers.
ttj: Common Voice etandikire omukutu ogwa kabiri ogurukukora ha kusorooza embazo ezitateekaniziibwe. Kinu nikiija kuyamba ebicweka ebingi kusorooza ebintu bwango bwango. Ebisorooziibwe nibiija kukonyeera abakugu n'abombeki b'ebisoorozibwe.

source: Contact us
ttj: Tuhikirre

source: Continue
ttj: Gumizaamu

source: Continue speaking
ttj: Gumizaamu noobaza

source: Contribute
ttj: Hayo ebyawe

source: Contributing to <bold>{ $language }</bold> dataset
ttj: Nikyongerereza<bold>{ $language }</bold>ha birukusorozebwa

source: Correct
ttj: Kihikire

source: Country/Region of Residence
ttj: Ensi/Ekicweka nambere orukwikara

source: Dataset: { $datasetLanguage }
ttj: Ebisoroziibwe: { $datasetLanguage }

source: Delete
ttj: Simuura

source: Different language
ttj: Orulimi orundi

source: do
ttj: Kora

source: Done
ttj: Kihweire

source: do not
ttj: Otakikora

source: Don't wish to say
ttj: Tindukwenda kwatura

source: Edit
ttj: Gorra

source: e.g., “What do you wish you could use technology for?”
ttj: Tekinorogiya wakugondeze kugyeyambisa kukora ki?

source: Email: <emailFragment>commonvoice@mozilla.com</emailFragment>
ttj: Imeiri: <emailFragment>commonvoice@mozilla.com</emailFragment>

source: Enter your Country/Region of Residence
ttj: Ijuzaamu ensi yaawe/ekicweka kyawe nambere orukwikara

source: Enter your email
ttj: Ijuzaamu endagirro yaawe ey'omukura gwa imeiri

source: Error
ttj: Ensobi

source: Error while playing audio file.
ttj: Haroho ensobi omu teera akatambi k'amaraka

source: Exceeded 25 questions. Reduce number of questions and retry.
ttj: Ohingwize ebikaguzo 25. Keehya omuhendo gw'ebikaguzo, oyongere olengeho.

source: Express or solicit prejudiced or offensive sentiments
ttj: Heereza rundi osabe ebiteekerezo ebitarukuha abantu abandi ekitinisa.

source: Female/Feminine
ttj: Mukazi/Eby'ekikazi

source: Guidelines
ttj: Endagirro

source: How Spontaneous Speech works
ttj: Orubazo orutateekaniziibwe nkooku ruba

source: I agree to Common Voice's <termsLink>Terms</termsLink> and <privacyLink>Privacy Notice</privacyLink>
ttj: Ninyikiriza enteekereza ya Common Voices <termsLink>Terms</termsLink> and <privacyLink>Privacy Notice</privacyLink>

source: * I confirm that this question is <publicDomainLink>public domain</publicDomainLink> and I have permission to upload it.
ttj: * Ningumya ngu ekikaguzo kinu tikiri <publicDomainLink>public domain</publicDomainLink> ky'ensita.

source: Interested in getting involved with this project, or partnering with us?
ttj: Nooyetaaga kwetaba mu mulimo gunu rundi kukuragana naitwe?

source: Intersex
ttj: Owa hagati na hagati

source: Just respond to the prompt as naturally as you can in a couple of sentences. Make sure your language is respectful and inoffensive.
ttj: Garukamu ekikusabirwe otabandize kuteekereza muno. Oroole ngu ebigambo byawe tibiri kujuma kandi nibitamu abantu ekitiinisa.

source: Learn how to check a transcription
ttj: Yega kukebera amaraka aga handiikirwe

source: Learn how to transcribe
ttj: Yega kuta amaraka mu buhandiiki

source: Learn how to use this page
ttj: Yega kukozesa peeji eni

source: Listen
ttj: Huliiriza

source: Loading…
ttj: Birimu kwija…

source: Log In
ttj: Taahamu

source: Log In / Sign Up
ttj: Taahamu/Wehandiikise

source: Log Out
ttj: Tuurukama

source: Make sure they can be answered in just a couple of sentences
ttj: Rora ngu nibisobora kugarukwamu omu sentensi enke muno.

source: Male/Masculine
ttj: Musaija/Eby'ekisaija

source: <mark>Check</mark>
ttj: <mark>Kebera</mark>

source: <mark>Prompt</mark>
ttj: <mark>Kaguza<mark>

source: <mark>Respond</mark>
ttj: <mark>Garukamu</mark>

source: <mark>Transcribe</mark>
ttj: <mark>Teeka iraka omu buhandiiki</mark>

source: More languages coming soon
ttj: Endimi ezindi niziija omu bwire obutali bwa hara

source: Non-binary
ttj: Obuhangwa obutali bukazi rundi busaija

source: Not Found
ttj: Tikizoirwe

source: Offensive Content
ttj: Ebirukubihiiza? Ebirukutabura?

source: Other
ttj: Ekindi

source: Personally Identifiable Information
ttj: Ebintu ebirukukwata ha muntu nk'omuntu

source: Platform language
ttj: Orulimi orw'omukutu

source: Question
ttj: Kaguza

source: Record your response
ttj: Kwata iraka ery'okugarukamu kwawe

source: Report
ttj: lipoota

source: Report was passed successfully
ttj: Lipoota ehairweyo kurungi

source: Request New Language
ttj: Saba orulimi oruhyaka

source: Respond
ttj: Garukamu

source: Response deleted successfully
ttj: Ekigarukwamu kisimwirwe kurungi

source: Response submitted successfully
ttj: Ekigarukwamu kihairweyo kurungi

source: Review
ttj: Garukamu oyetegereze

source: Select your age
ttj: Omuli ebi ebikuhairwe, komamu emyaka yaawe ey'obukuru.

source: Select your sex or gender
ttj: Komamu obuzarwa bwawe nk'omusaija rundi nk'omukazi

source: Send a link to my email
ttj: Sindika ensumiikanizi ha mukura gwange ogwa imeiri

source: Skip
ttj: Guruka

source: Skipped
ttj: Kigurukirwe

source: Solicit personally identifying information (like names or financial information)
ttj: Saba ebintu ebirukurangirra omuntu, nk'amabara rundi ebirukukwata ha bya sente

source: Something went wrong while fetching audio for transcriptions. Please try again later.
ttj: Habaireho ensobi omu kuleeta akatambi k'amaraka akarukugenda n'ekihandiiko.

source: Something went wrong while fetching prompts. Please try again later.
ttj: Haroho ekisobere omu kuleeta ebirukuleetereza. Yongera olengeho hanyuma.

source: Something went wrong while fetching transcriptions. Please try again later.
ttj: Haroho ekisobere omu kuleeta ebihandiiko by'amaraka. Yongera olengeho hanyuma.

source: Submit
ttj: Hayo

source: Submit All
ttj: Hayo byona

source: Submit a report
ttj: Hayo lipoota

source: Submitted
ttj: Kiheirweyo

source: Success
ttj: Obusinguzi

source: Tap
ttj: Teeraho

source: Thank you for contributing to Spontaneous Speech!
ttj: Weebale kwetaba omu Spontaneous Speech!

source: Thank you for your information
ttj: Weebale habwa ebi otugambiire.

source: The content contains a language different than I was expecting.
ttj: Ebirukugambwaho biri mu rulimi oru mbaire ntarukunihira

source: The content has disrespectful or offensive language.
ttj: Ebintu ebirukugambwaho biri mu rulimi orukurabyamu amaiso rundi orukutabura.

source: The MediaRecorder API is not supported in your browser.
ttj: Puroguraamu yaawe enseruzi terukusagika enkwatamara n'ebisani (Media Recorder) eya API.

source: The page you are looking for could not be found
ttj: Peeji ei orukuserra tezoirwe

source: There are currently no prompts for this language. Please refresh the page or try again later.
ttj: Orulimi runu tirwine ebirukuleetereza (prompts) omu kasumi kanu.

source: There are currently no transcriptions to check for this language. Please refresh the page or try again later.
ttj: Orulimi runu tirwine bihandiiko by'amaraka omu kasumi kanu. Noosobora kusisimura peeji rundi kulengeho hanyuma.

source: There is currently no audio to transcribe for this language. Please refresh the page or try again later.
ttj: Obwire bunu tiharoho katambi k'amaraka akookuta mu buhandiiki mu rulimi runu.

source: This content contains personally identifiable information related to an individual's identity, such as their name, email address, location, identification number, or phone number.
ttj: Ebintu binu ebirukugambwaho nibikwata ha muntu nk'omuntu.

source: This content is asking for personally identifiable information related to an individual's identity, such as their name, email address, location, identification number, or phone number.
ttj: Ebirukugambwaho binu nibisaba ebintu ebirukugambwaho ebirukukwata ha muntu nk'omuntu.

source: This information is optional to provide - you should only add it if you feel comfortable. When we release the dataset, we pseudonymise all personal information, and make sure information like your name and email are not connected to demographic information like age or sex. For technology to work well for everyone, the data that helps developers to build technology needs to reflect a diverse range of people. Learn more about why metadata matters.
ttj: Hanu noosobora kwijuzaamu rundi obutaijuzaamu. Obu oraaba noorora ngu tikine nsonga, ijuzaamu.Obu turaaba nituturukya ebisoroziibwe, ebintu ebirukukurangirra nka iwe omuntu nk'amabara titurukwija kubyoleka. Orole ngu ebintu nk'amabara gaawe n'endagirro y'ebbaroha yaawe ey'omukura gwa imeiri tibyolekerwe omu buzaale n'ebintu, nk'emyaka n'obuzarwa bwawe nk'omukazi rundi nk'omusaija, ebirukwoleka ekika kyawe nk'omuntu. Tekinorogiya okusobora kukorra kurungi buli omu, twine kutunga ebiteekerezo eby'abantu aba buli mulingo okusobora kuyamba abakugu kwombeka tekinorogiya eya boona. Yega ebirukukiraho ebirukwoleka omugaso gw'obugambo obusoborozi (metadata).

source: Transcribe
ttj: Teeka iraka omu buhandiiki

source: Transcript edited successfully
ttj: Ekihandiiko ky'amaraka kigoroirwe kurungi

source: Transcript skipped successfully
ttj: Ekihandiiko ky'amaraka kigurukirwe kurungi

source: Transcript submitted successfully
ttj: Akatambi k'amaraka katairwe mu buhandiiki kurungi

source: Transcript voted successfully
ttj: Ekihandiiko ky'amaraka kikomerwe kurungi

source: Transgender
ttj: Obuhangwa obutali bw'enzarwa

source: { $uploadedQuestions } of { $totalQuestions } questions collected
ttj: of { $totalQuestions } questions collected

source: { $uploadedQuestions } of { $totalQuestions } questions collected. View our <guidelinesLink>Guidelines</guidelinesLink> pages to learn more about how to add questions
ttj: { "\u0009" }{ $uploadedQuestions } of { $totalQuestions } questions collected. View our <guidelinesLink>Guidelines</guidelinesLink> pages to learn more about how to add questions

source: Upload failed, please retry.
ttj: Ebyokutahya byayanga, yongera olengeho.

source: Use correct spelling and grammar
ttj: Kozesa empandiika hamu n'amateeka ag'empandiika y'orulimi agahikire.

source: Useful for <mark>organic speech contexts</mark> and use cases (eg, when you want speech recognition to work with people speaking unscripted and colloquially)
ttj: Omugaso gwagwo <mark>organic speech contexts</mark> hamu na nambeere gukwetagisibwa (ekyokurorraaho, obu orukuba nooyenda enkwata maraka kukwata embazo z'abantu eza buli kiro ezitateekaniziibwe).

source: Welcome to Spontaneous Speech
ttj: Weebale kwija ha rubazo orutateekaniziibwe

source: We periodically release the dataset
ttj: Ebitusoroize tubiturukya buli hanyuma y'akasumi

source: We will show you a prompt or question
ttj: Nitwija kukwoleka ekikaguzo rundi ekintu ekiraakuleetereza kugarukamu

source: What issues are you experiencing with this content?
ttj: Nsonga ki ezi osangire omu bintu binu?

source: What is your age?
ttj: Oine emyaka ingaha?

source: What is your sex or gender?
ttj: Oli mukazi rundi oli musaija?

source: What questions can I add?
ttj: Nyongereho bikaguzo ki?

source: Why are you asking?
ttj: Habwaki nookaguza?

source: Why we built this Spontaneous Speech prototype
ttj: Ensonga habwaki twataireho enkora y'orubazo orutateekaniziibwe

source: Write down exactly what the person said, including placeholder words like 'um', or 'errr'.
ttj: Handiika eki kyonyini omuntu eki abalize, n'ebihuuno nka 'um' rundi errr' nuho otaire.

source: Write down what you hear the person saying here
ttj: Handiika ebi orukuhurra omuntu naagamba

source: You check whether the transcription matches the audio
ttj: Kebera orole ebi handiikirwe obu biraaba nibisisana n'ebyo ebiri mu katambi ak'amaraka

source: You have unsaved changes on this page. If you change the locale, your changes will not be saved. Are you sure you want to change the locale?
ttj: Haroho ebintu ebi otakaahwire ha peeji enu. Obu oraaruga ha mwanya gunu, ebintu ebi okozere tibirukwija kwahurwa. Noogumya kwo ngu nooyenda kuhindura omwanya?

source: You have unsaved changes on this page. If you leave this page, your changes will not be saved. Are you sure you want to leave this page?
ttj: Haroho ebintu ebi otakaahwire ha peeji enu. Obu oraagirugaho, ebi okozere tibirukwija kwahurwa. Noogumya kwo ngu nooyenda kuruga ha peeji enu?

source: You must allow microphone access.
ttj: Oine kwikiriza omuzindaro

source: You respond or reply to it as naturally as you can
ttj: Garukamu omu mulingo ogwa buli kiro otabandize kwecumiitiriza

source: You write down what you hear in the audio clips
ttj: Handiika ebi orukuhurra omu butambi obw'amaraka
